package com.ssafy.stomp.word.model;

import java.util.*;

/**
 * 초성 정의
 */

public class InitialConsonant {
    //2글자인 경우 - 총 조합: 14*14=196
    private static List<String> initialConsonats = new ArrayList<>(Arrays.asList(new String[]
            {
                    "ㄱㄱ", "ㄱㄴ", "ㄱㄷ", "ㄱㄹ", "ㄱㅁ","ㄱㅂ", "ㄱㅅ","ㄱㅇ", "ㄱㅈ","ㄱㅊ", "ㄱㅋ","ㄱㅌ", "ㄱㅍ","ㄱㅎ",
                    "ㄴㄱ", "ㄴㄴ", "ㄴㄷ", "ㄴㄹ", "ㄴㅁ","ㄴㅂ", "ㄴㅅ","ㄴㅇ", "ㄴㅈ","ㄴㅊ", "ㄴㅋ","ㄴㅌ", "ㄴㅍ","ㄴㅎ",
                    "ㄷㄱ", "ㄷㄴ", "ㄷㄷ", "ㄷㄹ", "ㄷㅁ","ㄷㅂ", "ㄷㅅ","ㄷㅇ", "ㄷㅈ","ㄷㅊ", "ㄷㅋ","ㄷㅌ", "ㄷㅍ","ㄷㅎ",
                    "ㄹㄱ", "ㄹㄴ", "ㄹㄷ", "ㄹㄹ", "ㄹㅁ","ㄹㅂ", "ㄹㅅ","ㄹㅇ", "ㄹㅈ","ㄹㅊ", "ㄹㅋ","ㄹㅌ", "ㄹㅍ","ㄹㅎ",
                    "ㅁㄱ", "ㅁㄴ", "ㅁㄷ", "ㅁㄹ", "ㅁㅁ","ㅁㅂ", "ㅁㅅ","ㅁㅇ", "ㅁㅈ","ㅁㅊ", "ㅁㅋ","ㅁㅌ", "ㅁㅍ","ㅁㅎ",
                    "ㅂㄱ", "ㅂㄴ", "ㅂㄷ", "ㅂㄹ", "ㅂㅁ","ㅂㅂ", "ㅂㅅ","ㅂㅇ", "ㅂㅈ","ㅂㅊ", "ㅂㅋ","ㅂㅌ", "ㅂㅍ","ㅂㅎ",
                    "ㅅㄱ", "ㅅㄴ", "ㅅㄷ", "ㅅㄹ", "ㅅㅁ","ㅅㅂ", "ㅅㅅ","ㅅㅇ", "ㅅㅈ","ㅅㅊ", "ㅅㅋ","ㅅㅌ", "ㅅㅍ","ㅅㅎ",
                    "ㅇㄱ", "ㅇㄴ", "ㅇㄷ", "ㅇㄹ", "ㅇㅁ","ㅇㅂ", "ㅇㅅ","ㅇㅇ", "ㅇㅈ","ㅇㅊ", "ㅇㅋ","ㅇㅌ", "ㅇㅍ","ㅇㅎ",
                    "ㅈㄱ", "ㅈㄴ", "ㅈㄷ", "ㅈㄹ", "ㅈㅁ","ㅈㅂ", "ㅈㅅ","ㅈㅇ", "ㅈㅈ","ㅈㅊ", "ㅈㅋ","ㅈㅌ", "ㅈㅍ","ㅈㅎ",
                    "ㅊㄱ", "ㅊㄴ", "ㅊㄷ", "ㅊㄹ", "ㅊㅁ","ㅊㅂ", "ㅊㅅ","ㅊㅇ", "ㅊㅈ","ㅊㅊ", "ㅊㅋ","ㅊㅌ", "ㅊㅍ","ㅊㅎ",
                    "ㅋㄱ", "ㅋㄴ", "ㅋㄷ", "ㅋㄹ", "ㅋㅁ","ㅋㅂ", "ㅋㅅ","ㅋㅇ", "ㅋㅈ","ㅋㅊ", "ㅋㅋ","ㅋㅌ", "ㅋㅍ","ㅋㅎ",
                    "ㅌㄱ", "ㅌㄴ", "ㅌㄷ", "ㅌㄹ", "ㅌㅁ","ㅌㅂ", "ㅌㅅ","ㅌㅇ", "ㅌㅈ","ㅌㅊ", "ㅌㅋ","ㅌㅌ", "ㅌㅍ","ㅌㅎ",
                    "ㅍㄱ", "ㅍㄴ", "ㅍㄷ", "ㅍㄹ", "ㅍㅁ","ㅍㅂ", "ㅍㅅ","ㅍㅇ", "ㅍㅈ","ㅍㅊ", "ㅍㅋ","ㅍㅌ", "ㅍㅍ","ㅍㅎ",
                    "ㅎㄱ", "ㅎㄴ", "ㅎㄷ", "ㅎㄹ", "ㅎㅁ","ㅎㅂ", "ㅎㅅ","ㅎㅇ", "ㅎㅈ","ㅎㅊ", "ㅎㅋ","ㅎㅌ", "ㅎㅍ","ㅎㅎ"
            }));

    //랜덤으로 섞어서 하나 뽑기
    public static String getRandomWord() {
        Collections.shuffle(initialConsonats);
        return initialConsonats.get(0);
    }
}
