package com.ssafy.stomp.liargame.model;

import lombok.Getter;

import java.util.*;

/**
 * 제시어 정의 : 일반 유저와 라이어의 제시어가 겹치지 않도록 하기
 */

@Getter
public class Subject {
    private List<String> subjects; //제시어

    public Subject(String theme){
        this.subjects = wordMap.get(theme);
    }

    private Map<String, List<String>> wordMap
            = new HashMap<String, List<String>>() {
        {
            put("동물", animal);
            put("나라", country);
            put("음식", food);
            put("영화", movie);
        }
    };

    static List<String> animal = new ArrayList<>(Arrays.asList(new String[]
            {
                    "두더지","개","개미핥기","원숭이","고라니","고래","고릴라","고슴도치","고양이","곰",
                    "기린","나무늘보","낙타","날다람쥐","너구리","늑대","다람쥐","당나귀","돌고래","돼지",
                    "말","멧돼지","물개","바다표범","박쥐","반달가슴곰","북극곰","북극여우",
                    "불독","사막여우","사슴","사자","생쥐","수달","스컹크","알파카","여우","염소",
                    "오랑우탄","오소리","원숭이","족제비","청설모","치와와","치타","침팬지","캥거루","코끼리",
                    "코뿔소","코알라","토끼","펭귄","표범","호랑이"
            }));

    static List<String> country = new ArrayList<>(Arrays.asList(new String[]
            {
                    "그리스", "네팔", "노르웨이", "뉴질랜드", "대한민국",
                    "덴마크", "독일", "라오스", "레바논", "룩셈부르크", "말레이시아", "멕시코", "몰디브", "미국", "베네수엘라", "베트남", "벨기에", "북한",
                    "스위스", "스페인", "싱가포르", "아르헨티나", "아프가니스탄", "영국", "이집트", "이탈리아", "인도", "일본", "중국",
                    "태국", "터키", "프랑스", "핀란드", "필리핀", "헝가리", "호주"
            }));

    static List<String> food = new ArrayList<>(Arrays.asList(new String[]
            {"김치", "푸아그라", "파스타", "스시", "똠양꿍", "나시고랭", "탄두리치킨", "퐁듀", "케밥", "와플", "타코", "딤섬",
                    "피쉬앤칩스", "쌀국수", "불고기", "비빔밥", "냉면", "떡볶이", "감자탕", "삼계탕", "전", "김치찌개", "카레", "돈까스", "우동", "타코야키",
                    "만두", "훠궈", "마라탕", "양꼬치", "취두부", "팟타이", "똠양꿍", "스테이크", "바게트", "햄버거", "핫도그", "피자", "스파게티"
            }));

    static List<String> movie = new ArrayList<>(Arrays.asList(new String[]
            {"어벤져스", "아바타", "타이타닉", "스타워즈", "쥬라기 월드", "분노의 질주", "겨울왕국", "해리 포터", "미녀와 야수", "인크레더블",
                    "아이언맨", "미니언즈", "캡틴 아메리카", "아쿠아맨", "트랜스포머", "다크 나이트 라이즈", "토이 스토리", "캐리비안의 해적", "이상한 나라의 앨리스", "라이온 킹",
                    "니모를 찾아서", "바람과 함께 사라지다", "사운드 오브 뮤직", "ET", "명량", "극한직업", "신과함께", "국제시장", "베테랑", "도둑들", "7번방의 선물", "암살",
                    "알라딘", "광해, 왕이 된 남자", "부산행", "해운대", "괴물", "왕의 남자", "인터스텔라", "인셉션", "기생충", "보헤미안 랩소디", "검사외전", "엑시트", "내부자들",
                    "국가대표", "디워", "히말라야", "밀정", "써니", "스파이더맨", "터널"
            }));
}
